a = 'hello
x  '' world
world
hello';

a = 'hello -
     hello -
world';

dcl-pi;
end-pi;
  end-pi;
dcl-pr;
end-pr;
  end-pr;
dcl-ds;
end-ds;
  end-ds;
dcl-ds likeds(abc);
  likeds(abc);
if;
elseif;
else;
endif;
  elseif;
  else;
  endif;
dow;
  leave;
enddo;
  enddo;
  iter;
  leave;

for;
endfor;
  endfor;
monitor;
on-error;
endmon;
  on-error;
  endmon;

select;
when;
other;
endsl;
  when
  other;
  endsl;

%char
%str
  %err

abc()
  abc())
  )
begsr;
endsr;
  endsr;
dcl-proc;
end-proc;
  end-proc;
dcl-pi;
end-pi;
  end-pi;
